---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PolylineSegments Properties
PolylineSegments Class See Also Send Feedback
---

The PolylineSegments type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | EndLocalParameter | Local parameter associated with the end point. |
|  | EndParameter | Parameter associated with the end point. |
|  | IsFilled | Indicates whether the area enclosed by the polyline is to be filled or not. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LineProperties | Access to the line (pen) properties of the polyline |
|  | StartLocalParameter | Local parameter associated with the start point. |
|  | StartParameter | Parameter associated with the start point. |

# See Also

PolylineSegments Class

Autodesk.Revit.DB Namespace